'''
Поработайте с переменными, создайте несколько, выведите на экран,
запросите у пользователя несколько чисел и строк и сохраните в переменные,
выведите на экран. '''

number = 2
print(number)

string = 'Делаю дз по-новой'
print(string)


ask_number = input('Введите цифру \n')
number_2 = ask_number
print("Число, которое Вы ввели:", number_2)

ask_string = input("Введите произвольную строку \n")
string_2 = ask_string
print("Ваша строка, вы только что ее ввели, но, возможно забыли. Вот - напоминаю:", string_2)

